For a cloned instance, where the original instance has the GCP's deletion protection enabled:

```
$ gcloud sql instances describe test123 | grep deletionProtectionEnabled
  deletionProtectionEnabled: true

$ TF_LOG=debug TF_LOG_PATH=tf-apply.log terraform apply -auto-approve
data.google_sql_database_instance.origin: Reading...
data.google_sql_database_instance.origin: Read complete after 0s [id=test123]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database_instance.test will be created
  + resource "google_sql_database_instance" "test" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_14"
      + deletion_protection           = false
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "test10-49"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "europe-west1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + clone {
          + source_instance_name = "test123"
        }

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = (known after apply)
          + availability_type     = (known after apply)
          + collation             = (known after apply)
          + disk_autoresize       = (known after apply)
          + disk_autoresize_limit = (known after apply)
          + disk_size             = (known after apply)
          + disk_type             = (known after apply)
          + pricing_plan          = (known after apply)
          + tier                  = (known after apply)
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + active_directory_config {
              + domain = (known after apply)
            }

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + database_flags {
              + name  = (known after apply)
              + value = (known after apply)
            }

          + insights_config {
              + query_insights_enabled  = (known after apply)
              + query_string_length     = (known after apply)
              + record_application_tags = (known after apply)
              + record_client_address   = (known after apply)
            }

          + ip_configuration {
              + allocated_ip_range = (known after apply)
              + ipv4_enabled       = (known after apply)
              + private_network    = (known after apply)
              + require_ssl        = (known after apply)

              + authorized_networks {
                  + expiration_time = (known after apply)
                  + name            = (known after apply)
                  + value           = (known after apply)
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }

          + maintenance_window {
              + day          = (known after apply)
              + hour         = (known after apply)
              + update_track = (known after apply)
            }

          + sql_server_audit_config {
              + bucket             = (known after apply)
              + retention_interval = (known after apply)
              + upload_interval    = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_sql_database_instance.test: Creating...
google_sql_database_instance.test: Still creating... [10s elapsed]
google_sql_database_instance.test: Still creating... [20s elapsed]
google_sql_database_instance.test: Still creating... [30s elapsed]
google_sql_database_instance.test: Still creating... [40s elapsed]
google_sql_database_instance.test: Still creating... [50s elapsed]
google_sql_database_instance.test: Still creating... [1m0s elapsed]
google_sql_database_instance.test: Still creating... [1m10s elapsed]
google_sql_database_instance.test: Still creating... [1m20s elapsed]
google_sql_database_instance.test: Still creating... [1m30s elapsed]
google_sql_database_instance.test: Still creating... [1m40s elapsed]
google_sql_database_instance.test: Still creating... [1m50s elapsed]
google_sql_database_instance.test: Still creating... [2m0s elapsed]
google_sql_database_instance.test: Still creating... [2m10s elapsed]
google_sql_database_instance.test: Still creating... [2m20s elapsed]
google_sql_database_instance.test: Still creating... [2m30s elapsed]
google_sql_database_instance.test: Still creating... [2m40s elapsed]
google_sql_database_instance.test: Still creating... [2m50s elapsed]
google_sql_database_instance.test: Still creating... [3m0s elapsed]
google_sql_database_instance.test: Still creating... [3m10s elapsed]
google_sql_database_instance.test: Still creating... [3m20s elapsed]
google_sql_database_instance.test: Still creating... [3m30s elapsed]
google_sql_database_instance.test: Still creating... [3m40s elapsed]
google_sql_database_instance.test: Still creating... [3m50s elapsed]
google_sql_database_instance.test: Still creating... [4m0s elapsed]
google_sql_database_instance.test: Still creating... [4m10s elapsed]
google_sql_database_instance.test: Still creating... [4m20s elapsed]
google_sql_database_instance.test: Still creating... [4m30s elapsed]
google_sql_database_instance.test: Still creating... [4m40s elapsed]
google_sql_database_instance.test: Still creating... [4m50s elapsed]
google_sql_database_instance.test: Still creating... [5m0s elapsed]
google_sql_database_instance.test: Still creating... [5m10s elapsed]
google_sql_database_instance.test: Still creating... [5m20s elapsed]
google_sql_database_instance.test: Still creating... [5m30s elapsed]
google_sql_database_instance.test: Still creating... [5m40s elapsed]
google_sql_database_instance.test: Still creating... [5m50s elapsed]
google_sql_database_instance.test: Still creating... [6m0s elapsed]
google_sql_database_instance.test: Still creating... [6m10s elapsed]
google_sql_database_instance.test: Still creating... [6m20s elapsed]
google_sql_database_instance.test: Still creating... [6m30s elapsed]
google_sql_database_instance.test: Still creating... [6m40s elapsed]
google_sql_database_instance.test: Still creating... [6m50s elapsed]
google_sql_database_instance.test: Still creating... [7m0s elapsed]
google_sql_database_instance.test: Still creating... [7m10s elapsed]
google_sql_database_instance.test: Still creating... [7m20s elapsed]
google_sql_database_instance.test: Still creating... [7m30s elapsed]
google_sql_database_instance.test: Still creating... [7m40s elapsed]
google_sql_database_instance.test: Still creating... [7m50s elapsed]
google_sql_database_instance.test: Still creating... [8m0s elapsed]
google_sql_database_instance.test: Still creating... [8m10s elapsed]
google_sql_database_instance.test: Still creating... [8m20s elapsed]
google_sql_database_instance.test: Still creating... [8m30s elapsed]
google_sql_database_instance.test: Still creating... [8m40s elapsed]
google_sql_database_instance.test: Creation complete after 8m41s [id=test10-49]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ cp terraform.tfstate terraform.tfstate.before-destroy

$ gcloud sql instances describe test10-49  | grep deletionProtectionEnabled
  deletionProtectionEnabled: true
```

The apply logs and the state at this stage:

* [tf-apply.log.gz](https://github.com/hashicorp/terraform-provider-google/files/9393147/tf-apply.log.gz)
* [terraform.tfstate.before-destroy.gz](https://github.com/hashicorp/terraform-provider-google/files/9393146/terraform.tfstate.before-destroy.gz)


```
$ TF_LOG=debug TF_LOG_PATH=tf-destroy.log terraform destroy -auto-approve
data.google_sql_database_instance.origin: Reading...
data.google_sql_database_instance.origin: Read complete after 0s [id=test123]
google_sql_database_instance.test: Refreshing state... [id=test10-49]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # google_sql_database_instance.test will be destroyed
  - resource "google_sql_database_instance" "test" {
      - connection_name               = "my-project-id:europe-west1:test10-49" -> null
      - database_version              = "POSTGRES_14" -> null
      - deletion_protection           = false -> null
      - first_ip_address              = "34.77.110.182" -> null
      - id                            = "test10-49" -> null
      - ip_address                    = [
          - {
              - ip_address     = "34.77.110.182"
              - time_to_retire = ""
              - type           = "PRIMARY"
            },
          - {
              - ip_address     = "34.78.191.29"
              - time_to_retire = ""
              - type           = "OUTGOING"
            },
          - {
              - ip_address     = "10.4.172.25"
              - time_to_retire = ""
              - type           = "PRIVATE"
            },
        ] -> null
      - name                          = "test10-49" -> null
      - private_ip_address            = "10.4.172.25" -> null
      - project                       = "my-project-id" -> null
      - public_ip_address             = "34.77.110.182" -> null
      - region                        = "europe-west1" -> null
      - self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/my-project-id/instances/test10-49" -> null
      - server_ca_cert                = [
          - {
              - cert             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ4ZTI5
                    MmMyNC1lYzY1LTRmOTMtOWVmZi04YTZmMDY2NTE2NzIxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjIwODIyMDgzNzIzWhcNMzIwODE5MDgzODIzWjB3MS0wKwYD
                    VQQuEyQ4ZTI5MmMyNC1lYzY1LTRmOTMtOWVmZi04YTZmMDY2NTE2NzIxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQDm2+WMZ49HaH7cFcmiLFLC5OronYOaBp853URGuN7EAEmlKI6vQF54PzMwZkdV
                    6jpI8u0+MwxemeYbYbc7xyP+BKr99i9N3zcXngokwCnY9KNQs0qSSvBrRhk2LrVr
                    RnZVd4rKBYFCo1iVu6PmLQ0i8GIHznxIhFk2fi02J/DoZK1a7mC5sHDPDgEJDxr/
                    4HqVx93X3r+ENcmxlfRJUovx6SkNz6aNaRiO3sHANTBa8hGIejwega0rl10WxDSl
                    Or5mgQBUJB3GMj3I5HI5MhZI5uo1iYjXT4NgLej3Fda7c6H81dRABexp6MB93Vtq
                    WdPIobHnc+KygebFTnUJSLKzAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBADaoCZOKC3NxmibYo9UMlFy4Yvg/L3xKFXG1DAGg
                    GrurJBHPiyGj4THAggdtu5gtfBkh1eQ4lcy4j2crsbtdK4PyTsPe5duvh5WTiyyv
                    d0vzFXI6hTLo/05xB3Q9nsJUUr6+SG/Y1VEKCWgkDJCX/+8wXeaDx4Q4OrZCdENj
                    mzexYVVq3DqJ2aUsOmElJQw6Ohh0SGzRRTxrqiHg3KWkOKcqmOeOadoXWchV4b0z
                    mFOsX5Zce7K31lYEoqmii20qfhCIofH53CgVmp0g4f3m95MFRr4x53KJcDoFYrKm
                    UGTfI4ZYeCc9IqQS6y5Wq5VLYT9dwHq8WgpgEWQ1qszkszc=
                    -----END CERTIFICATE-----
                EOT
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=8e292c24-ec65-4f93-9eff-8a6f06651672"
              - create_time      = "2022-08-22T08:37:23.888Z"
              - expiration_time  = "2032-08-19T08:38:23.888Z"
              - sha1_fingerprint = "331ec9fb9e5da80d650e3d6736d50e7effb57cdf"
            },
        ] -> null
      - service_account_email_address = "p288152489562-bzb7pn@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null

      - clone {
          - source_instance_name = "test123" -> null
        }

      - settings {
          - activation_policy     = "ALWAYS" -> null
          - availability_type     = "ZONAL" -> null
          - disk_autoresize       = true -> null
          - disk_autoresize_limit = 0 -> null
          - disk_size             = 100 -> null
          - disk_type             = "PD_SSD" -> null
          - pricing_plan          = "PER_USE" -> null
          - tier                  = "db-custom-2-8192" -> null
          - user_labels           = {} -> null
          - version               = 2 -> null

          - backup_configuration {
              - binary_log_enabled             = false -> null
              - enabled                        = true -> null
              - location                       = "eu" -> null
              - point_in_time_recovery_enabled = true -> null
              - start_time                     = "19:00" -> null
              - transaction_log_retention_days = 7 -> null

              - backup_retention_settings {
                  - retained_backups = 7 -> null
                  - retention_unit   = "COUNT" -> null
                }
            }

          - ip_configuration {
              - ipv4_enabled    = true -> null
              - private_network = "projects/my-project-id/global/networks/default" -> null
              - require_ssl     = false -> null
            }

          - location_preference {
              - zone = "europe-west1-b" -> null
            }
        }
    }

Plan: 0 to add, 0 to change, 1 to destroy.
google_sql_database_instance.test: Destroying... [id=test10-49]
╷
│ Error: Error, failed to delete instance test10-49: googleapi: Error 400: The instance is protected. Please disable the deletion protection and try again. To disable deletion protection, update the instance settings with deletionProtectionEnabled set to false., badRequest
│
│
╵
```

The logs for this first failing destroy: [tf-destroy.log.gz](https://github.com/hashicorp/terraform-provider-google/files/9393148/tf-destroy.log.gz)

Then, I remove the flag using the `gcloud` command:

```
$ gcloud sql instances describe test10-49  | grep deletionProtectionEnabled
  deletionProtectionEnabled: true

$ gcloud sql instances patch test10-49 --no-deletion-protection
The following message will be used for the patch API method.
{"name": "test10-49", "project": "my-project-id", "settings": {"deletionProtectionEnabled": false}}
Patching Cloud SQL instance...done.
Updated [https://sqladmin.googleapis.com/sql/v1beta4/projects/my-project-id/instances/test10-49].

$ gcloud sql instances describe test10-49  | grep deletionProtectionEnabled
  deletionProtectionEnabled: false
```

Then try to run Terraform's detroy again:

```
$ TF_LOG=debug TF_LOG_PATH=tf-destroy-2.log terraform destroy -auto-approve
data.google_sql_database_instance.origin: Reading...
data.google_sql_database_instance.origin: Read complete after 0s [id=test123]
google_sql_database_instance.test: Refreshing state... [id=test10-49]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # google_sql_database_instance.test will be destroyed
  - resource "google_sql_database_instance" "test" {
      - connection_name               = "my-project-id:europe-west1:test10-49" -> null
      - database_version              = "POSTGRES_14" -> null
      - deletion_protection           = false -> null
      - first_ip_address              = "34.77.110.182" -> null
      - id                            = "test10-49" -> null
      - ip_address                    = [
          - {
              - ip_address     = "34.77.110.182"
              - time_to_retire = ""
              - type           = "PRIMARY"
            },
          - {
              - ip_address     = "34.78.191.29"
              - time_to_retire = ""
              - type           = "OUTGOING"
            },
          - {
              - ip_address     = "10.4.172.25"
              - time_to_retire = ""
              - type           = "PRIVATE"
            },
        ] -> null
      - name                          = "test10-49" -> null
      - private_ip_address            = "10.4.172.25" -> null
      - project                       = "my-project-id" -> null
      - public_ip_address             = "34.77.110.182" -> null
      - region                        = "europe-west1" -> null
      - self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/my-project-id/instances/test10-49" -> null
      - server_ca_cert                = [
          - {
              - cert             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ4ZTI5
                    MmMyNC1lYzY1LTRmOTMtOWVmZi04YTZmMDY2NTE2NzIxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjIwODIyMDgzNzIzWhcNMzIwODE5MDgzODIzWjB3MS0wKwYD
                    VQQuEyQ4ZTI5MmMyNC1lYzY1LTRmOTMtOWVmZi04YTZmMDY2NTE2NzIxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQDm2+WMZ49HaH7cFcmiLFLC5OronYOaBp853URGuN7EAEmlKI6vQF54PzMwZkdV
                    6jpI8u0+MwxemeYbYbc7xyP+BKr99i9N3zcXngokwCnY9KNQs0qSSvBrRhk2LrVr
                    RnZVd4rKBYFCo1iVu6PmLQ0i8GIHznxIhFk2fi02J/DoZK1a7mC5sHDPDgEJDxr/
                    4HqVx93X3r+ENcmxlfRJUovx6SkNz6aNaRiO3sHANTBa8hGIejwega0rl10WxDSl
                    Or5mgQBUJB3GMj3I5HI5MhZI5uo1iYjXT4NgLej3Fda7c6H81dRABexp6MB93Vtq
                    WdPIobHnc+KygebFTnUJSLKzAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBADaoCZOKC3NxmibYo9UMlFy4Yvg/L3xKFXG1DAGg
                    GrurJBHPiyGj4THAggdtu5gtfBkh1eQ4lcy4j2crsbtdK4PyTsPe5duvh5WTiyyv
                    d0vzFXI6hTLo/05xB3Q9nsJUUr6+SG/Y1VEKCWgkDJCX/+8wXeaDx4Q4OrZCdENj
                    mzexYVVq3DqJ2aUsOmElJQw6Ohh0SGzRRTxrqiHg3KWkOKcqmOeOadoXWchV4b0z
                    mFOsX5Zce7K31lYEoqmii20qfhCIofH53CgVmp0g4f3m95MFRr4x53KJcDoFYrKm
                    UGTfI4ZYeCc9IqQS6y5Wq5VLYT9dwHq8WgpgEWQ1qszkszc=
                    -----END CERTIFICATE-----
                EOT
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=8e292c24-ec65-4f93-9eff-8a6f06651672"
              - create_time      = "2022-08-22T08:37:23.888Z"
              - expiration_time  = "2032-08-19T08:38:23.888Z"
              - sha1_fingerprint = "331ec9fb9e5da80d650e3d6736d50e7effb57cdf"
            },
        ] -> null
      - service_account_email_address = "p288152489562-bzb7pn@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null

      - clone {
          - source_instance_name = "test123" -> null
        }

      - settings {
          - activation_policy     = "ALWAYS" -> null
          - availability_type     = "ZONAL" -> null
          - disk_autoresize       = true -> null
          - disk_autoresize_limit = 0 -> null
          - disk_size             = 100 -> null
          - disk_type             = "PD_SSD" -> null
          - pricing_plan          = "PER_USE" -> null
          - tier                  = "db-custom-2-8192" -> null
          - user_labels           = {} -> null
          - version               = 3 -> null

          - backup_configuration {
              - binary_log_enabled             = false -> null
              - enabled                        = true -> null
              - location                       = "eu" -> null
              - point_in_time_recovery_enabled = true -> null
              - start_time                     = "19:00" -> null
              - transaction_log_retention_days = 7 -> null

              - backup_retention_settings {
                  - retained_backups = 7 -> null
                  - retention_unit   = "COUNT" -> null
                }
            }

          - ip_configuration {
              - ipv4_enabled    = true -> null
              - private_network = "projects/my-project-id/global/networks/default" -> null
              - require_ssl     = false -> null
            }

          - location_preference {
              - zone = "europe-west1-b" -> null
            }
        }
    }

Plan: 0 to add, 0 to change, 1 to destroy.
google_sql_database_instance.test: Destroying... [id=test10-49]
google_sql_database_instance.test: Still destroying... [id=test10-49, 10s elapsed]
google_sql_database_instance.test: Still destroying... [id=test10-49, 20s elapsed]
google_sql_database_instance.test: Still destroying... [id=test10-49, 30s elapsed]
google_sql_database_instance.test: Still destroying... [id=test10-49, 40s elapsed]
google_sql_database_instance.test: Still destroying... [id=test10-49, 50s elapsed]
google_sql_database_instance.test: Still destroying... [id=test10-49, 1m0s elapsed]
google_sql_database_instance.test: Still destroying... [id=test10-49, 1m10s elapsed]
google_sql_database_instance.test: Destruction complete after 1m13s

Destroy complete! Resources: 1 destroyed.
```

The logs for this last destroy: [tf-destroy-2.log.gz](https://github.com/hashicorp/terraform-provider-google/files/9393149/tf-destroy-2.log.gz)
